spacecmu-backend/tests/artillery/00-e2e-full.yml
# Artillery Test: Full End-to-End (E2E) — Realistic User Journey
# Simulates realistic mixed traffic across all modules.
# Run: artillery run 00-e2e-full.yml
#
# This file is SELF-CONTAINED (includes its own config).
# Recommended for final load testing before deployment.

config:
  target: "http://localhost:3001"
  http:
    timeout: 15
  variables:
    token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6ImYxMjU5OTdkLWM3MTYtNDlmZi1hMDY3LWM5ZmQwYzBlNDk0NCIsInJvbGUiOiJ1c2VyIiwidXNlcm5hbWUiOiI2NTA2MTIxMDIiLCJlbWFpbCI6InNpcmFwaG9iX2x1QGNtdS5hYy50aCIsIml0YWNjb3VudF9uYW1lIjoic2lyYXBob2JfbHUiLCJwcmVuYW1lX1RIIjoiIiwiZmlyc3RuYW1lX1RIIjoi4Liq4Li04Lij4Lig4LieIiwibGFzdG5hbWVfVEgiOiLguYDguKvguKXguLfguK3guIfguJvguKPguLDguYDguKrguKPguLTguJAiLCJvcmdhbml6YXRpb25fbmFtZV9USCI6IuC4hOC4k-C4sOC4p-C4tOC4qOC4p-C4geC4o-C4o-C4oeC4qOC4suC4quC4leC4o-C5jCIsImlhdCI6MTc3MzU4OTA0MiwiZXhwIjoxNzczNjc1NDQyfQ.7a_C0TnKVkRs9lEa3ge4Odxupdn1kc6HvOXVShkDPFY"
    myUserId: "f125997d-c716-49ff-a067-c9fd0c0e4944"
  phases:
    # Phase 1: Warm Up (1 min)
    - duration: 60
      arrivalRate: 2
      name: "Warm Up"
    # Phase 2: Ramp Up (2 min)
    - duration: 120
      arrivalRate: 2
      rampTo: 15
      name: "Ramp Up"
    # Phase 3: Peak Load (3 min)
    - duration: 180
      arrivalRate: 15
      name: "Peak Load"
    # Phase 4: Cool Down (1 min)
    - duration: 60
      arrivalRate: 15
      rampTo: 1
      name: "Cool Down"
  ensure:
    thresholds:
      - http.response_time.p95: 2000
      - http.response_time.p99: 5000
      - http.codes.5xx: 0   # Zero 5xx errors allowed

scenarios:
  # ── Weight Distribution (total = 100) ─────────────────────────────────────
  # Read scenarios: 70%
  # Write scenarios: 20%
  # Heavy flows: 10%

  # ─────────────────────────────────────────────────────────────────────────
  # READ SCENARIOS (70%)
  # ─────────────────────────────────────────────────────────────────────────

  - name: "Browse Feed → Session Info"
    weight: 15
    flow:
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/posts?category=Global"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/notifications/{{ myUserId }}"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "User Profile Page"
    weight: 12
    flow:
      - get:
          url: "/api/users/{{ myUserId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/posts/user/{{ myUserId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/friends/user/{{ myUserId }}"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "Market Browsing"
    weight: 12
    flow:
      - get:
          url: "/api/market/categories"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/market/items"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Friends & Social"
    weight: 10
    flow:
      - get:
          url: "/api/friends/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/friends/suggestions"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/friends/requests/me"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "Messaging Inbox"
    weight: 12
    flow:
      - get:
          url: "/api/chat-rooms/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/messages/unread/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Calendar & Events"
    weight: 9
    flow:
      - get:
          url: "/api/calendar/today"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/calendar/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  # ─────────────────────────────────────────────────────────────────────────
  # WRITE SCENARIOS (20%)
  # ─────────────────────────────────────────────────────────────────────────

  - name: "Create & Delete Post"
    weight: 8
    flow:
      - post:
          url: "/api/posts"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            content: "E2E test post 🚀 {{ $randomString() }}"
            category: "Global"
          capture:
            - json: "$.id"
              as: "postId"
          expect:
            - statusCode: 201
      - get:
          url: "/api/posts/{{ postId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - delete:
          url: "/api/posts/{{ postId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Create & Delete Market Item"
    weight: 7
    flow:
      - post:
          url: "/api/market/items"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            title: "E2E Test Item {{ $randomString() }}"
            description: "E2E test listing"
            price: 99
            category: "Other"
            condition: "new"
          capture:
            - json: "$.id"
              as: "itemId"
          expect:
            - statusCode: 201
      - delete:
          url: "/api/market/items/{{ itemId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Create & Delete Calendar Event"
    weight: 5
    flow:
      - post:
          url: "/api/calendar"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            title: "E2E Test Event"
            startTime: "2026-03-20T09:00:00Z"
            endTime: "2026-03-20T10:00:00Z"
            eventType: "class"
          capture:
            - json: "$.id"
              as: "eventId"
          expect:
            - statusCode: [200, 201]
      - delete:
          url: "/api/calendar/{{ eventId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: [200, 204]

  # ─────────────────────────────────────────────────────────────────────────
  # HEAVY FLOW SCENARIOS (10%)
  # ─────────────────────────────────────────────────────────────────────────

  - name: "Full User Journey"
    weight: 10
    flow:
      # 1. Check session
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      # 2. Load feed + notifications
      - get:
          url: "/api/posts?category=Global"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/notifications/{{ myUserId }}"
          headers:
            Authorization: "Bearer {{ token }}"

      # 3. Check messages
      - get:
          url: "/api/chat-rooms/me"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/messages/unread/me"
          headers:
            Authorization: "Bearer {{ token }}"

      # 4. Create a post
      - post:
          url: "/api/posts"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            content: "Full journey test post {{ $randomString() }}"
            category: "Global"
          capture:
            - json: "$.id"
              as: "postId"
          expect:
            - statusCode: 201

      # 5. Like it
      - post:
          url: "/api/posts/like"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            postId: "{{ postId }}"

      # 6. Check friends
      - get:
          url: "/api/friends/me"
          headers:
            Authorization: "Bearer {{ token }}"

      # 7. Browse market
      - get:
          url: "/api/market/items"
          headers:
            Authorization: "Bearer {{ token }}"

      # 8. Cleanup — unlike and delete post
      - post:
          url: "/api/posts/like"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            postId: "{{ postId }}"
      - delete:
          url: "/api/posts/{{ postId }}"
          headers:
            Authorization: "Bearer {{ token }}"