spacecmu-backend/tests/artillery/01-auth.yml
# Artillery Test: Auth & Health
# Tests: GET /, GET /api/auth/me, POST /api/auth/logout (soft)
# Run: artillery run --config config.yml 01-auth.yml

config:
  target: "http://localhost:3001"
  http:
    timeout: 10
  variables:
    token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6ImYxMjU5OTdkLWM3MTYtNDlmZi1hMDY3LWM5ZmQwYzBlNDk0NCIsInJvbGUiOiJ1c2VyIiwidXNlcm5hbWUiOiI2NTA2MTIxMDIiLCJlbWFpbCI6InNpcmFwaG9iX2x1QGNtdS5hYy50aCIsIml0YWNjb3VudF9uYW1lIjoic2lyYXBob2JfbHUiLCJwcmVuYW1lX1RIIjoiIiwiZmlyc3RuYW1lX1RIIjoi4Liq4Li04Lij4Lig4LieIiwibGFzdG5hbWVfVEgiOiLguYDguKvguKXguLfguK3guIfguJvguKPguLDguYDguKrguKPguLTguJAiLCJvcmdhbml6YXRpb25fbmFtZV9USCI6IuC4hOC4k-C4sOC4p-C4tOC4qOC4p-C4geC4o-C4o-C4oeC4qOC4suC4quC4leC4o-C5jCIsImlhdCI6MTc3MzU4OTA0MiwiZXhwIjoxNzczNjc1NDQyfQ.7a_C0TnKVkRs9lEa3ge4Odxupdn1kc6HvOXVShkDPFY"
  phases:
    - duration: 15
      arrivalRate: 5
      name: "Warm Up"
    - duration: 30
      arrivalRate: 5
      rampTo: 20
      name: "Ramp Up"
    - duration: 30
      arrivalRate: 20
      name: "Sustained Load"

scenarios:
  - name: "Health Check"
    weight: 3
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200

  - name: "Get Session Info (GET /api/auth/me)"
    weight: 7
    flow:
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
            - hasProperty: "user"
            - hasProperty: "activeUser"