spacecmu-backend/tests/artillery/02-users.yml
# Artillery Test: Users
# Tests: GET /me, GET /search, GET /batch, GET /:id
# Run: artillery run --config config.yml 02-users.yml

config:
  target: "http://localhost:3001"
  http:
    timeout: 10
  variables:
    token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6ImYxMjU5OTdkLWM3MTYtNDlmZi1hMDY3LWM5ZmQwYzBlNDk0NCIsInJvbGUiOiJ1c2VyIiwidXNlcm5hbWUiOiI2NTA2MTIxMDIiLCJlbWFpbCI6InNpcmFwaG9iX2x1QGNtdS5hYy50aCIsIml0YWNjb3VudF9uYW1lIjoic2lyYXBob2JfbHUiLCJwcmVuYW1lX1RIIjoiIiwiZmlyc3RuYW1lX1RIIjoi4Liq4Li04Lij4Lig4LieIiwibGFzdG5hbWVfVEgiOiLguYDguKvguKXguLfguK3guIfguJvguKPguLDguYDguKrguKPguLTguJAiLCJvcmdhbml6YXRpb25fbmFtZV9USCI6IuC4hOC4k-C4sOC4p-C4tOC4qOC4p-C4geC4o-C4o-C4oeC4qOC4suC4quC4leC4o-C5jCIsImlhdCI6MTc3MzU4OTA0MiwiZXhwIjoxNzczNjc1NDQyfQ.7a_C0TnKVkRs9lEa3ge4Odxupdn1kc6HvOXVShkDPFY"
    # Decoded from token — real user's ID
    myUserId: "f125997d-c716-49ff-a067-c9fd0c0e4944"
  phases:
    - duration: 15
      arrivalRate: 5
      name: "Warm Up"
    - duration: 30
      arrivalRate: 5
      rampTo: 20
      name: "Ramp Up"
    - duration: 30
      arrivalRate: 20
      name: "Sustained Load"

scenarios:
  - name: "Get Current User Profile"
    weight: 5
    flow:
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
            - hasProperty: "id"

  - name: "Get User By ID"
    weight: 4
    flow:
      - get:
          url: "/api/users/{{ myUserId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Search Users"
    weight: 4
    flow:
      - get:
          url: "/api/users/search?query=siraphob"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Get All Users"
    weight: 2
    flow:
      - get:
          url: "/api/users"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Batch Get Users"
    weight: 2
    flow:
      - get:
          url: "/api/users/batch?ids={{ myUserId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Update Bio"
    weight: 1
    flow:
      - patch:
          url: "/api/users/profile/bio"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            bio: "Load test bio — SpaceCMU 🚀"
          expect:
            - statusCode: 200